//----------------------------------------------------------------------------------------------
// $Date: 2010-12-03 02:53:46 +0300 (Птн, 03 Дек 2010) $
// $Author: antonbatenev.ya.ru $
// $Revision: 369 $
// $URL: svn://opensvn.ru/avalon/trunk/storage/database_error.cpp $
//----------------------------------------------------------------------------------------------
#include "database_error.h"
//----------------------------------------------------------------------------------------------

ADatabaseError::ADatabaseError ()
{
}
//----------------------------------------------------------------------------------------------

ADatabaseError::~ADatabaseError ()
{
}
//----------------------------------------------------------------------------------------------

void ADatabaseError::showError (QWidget* parent)
{
	QMessageBox::critical(parent, QString::fromUtf8("Ошибка!"), m_error_message);
}
//----------------------------------------------------------------------------------------------

QString ADatabaseError::getLastError () const
{
	return m_error_message;
}
//----------------------------------------------------------------------------------------------

void ADatabaseError::setLastError (const QString& message)
{
	m_error_message = message;
}
//----------------------------------------------------------------------------------------------
